

// Описание
// 
// Параметры:
// 	Пользователь - ПользовательИнформационнойБазы - текущий пользователь
// Возвращаемое значение:
// 	- СправочникСсылка.Пользователи - 
Функция НайтиИлиСоздатьПоНаименованию(Пользователь) Экспорт
	
	ПользовательСсылка = НайтиПоНаименованию(Пользователь.Имя);
	
	Если (ПользовательСсылка.Пустая()) Тогда
	
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = Пользователь.Имя;
		НовыйПользователь.ПолноеИмя    = Пользователь.ПолноеИмя;
		НовыйПользователь.ЗаполнитьСписокПрав();
		НовыйПользователь.Записать();
		
		ПользовательСсылка = НовыйПользователь.Ссылка;
	
	КонецЕсли;
	
	Возврат ПользовательСсылка;

КонецФункции