
Процедура ЗаполнитьСписокПрав() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
    
    НаборРолей = Метаданные.Роли;
        
    СписокПрав.Очистить(); //очистка ТЧ элемента
    
    Для Каждого Роль Из НаборРолей Цикл
      СтрокаРоли = СписокПрав.Добавить();
      СтрокаРоли.ИмяРоли           = Роль.Имя;
      СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
      СтрокаРоли.Включено          = Пользователь.Роли.Содержит(Роль);	
    КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	//если в ИБ не найдена учетка, соответствующего пользователя, то учетку надо создать
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя       = Наименование;
		Пользователь.ПолноеИмя = ПолноеИмя;
	КонецЕсли;
	
	//очистка списка ролей, если учетка была найдена. У только что созданной учетки список и так пуст 
	Пользователь.Роли.Очистить();
	
	//СписокРолей новой учетки заполняется всеми ролями с признаком Включено 
	СписокРолей = СписокПрав.НайтиСтроки( Новый Структура("Включено", Истина) );
	
	Для Каждого Роль Из СписокРолей Цикл
		Пользователь.Роли.Добавить( Метаданные.Роли.Найти(Роль.ИмяРоли) );		
	КонецЦикла;
	
	Пользователь.Записать();
		
КонецПроцедуры
